#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-ushc8oF9J3phJpWX

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_container_registry.repository: Refreshing state... [id=openarabic]
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
data.digitalocean_kubernetes_cluster.openarabic: Reading...
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 0s [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.load-tester: Refreshing state... [id=load-tester]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # helm_release.flagger will be created
  + resource "helm_release" "flagger" {
      + atomic                     = false
      + chart                      = "flagger"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flagger"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flagger.app"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.21.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "meshProvider"
          + value = "istio"
        }
      + set {
          + name  = "metricsServer"
          + value = "http://prometheus.istio-system:9090"
        }
      + set {
          + name  = "podMonitor.enabled"
          + value = "true"
        }
      + set {
          + name  = "prometheus.install"
          + value = "true"
        }
    }

  # helm_release.istio-base will be created
  + resource "helm_release" "istio-base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-base"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istio-istiod will be created
  + resource "helm_release" "istio-istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-istiod"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.load-tester will be destroyed
  # (because helm_release.load-tester is not in configuration)
  - resource "helm_release" "load-tester" {
      - atomic                     = false -> null
      - chart                      = "load-tester" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "load-tester" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "0.22.0"
              - chart       = "loadtester"
              - name        = "load-tester"
              - namespace   = "load-tester"
              - revision    = 1
              - values      = "null"
              - version     = "0.22.0"
            },
        ] -> null
      - name                       = "load-tester" -> null
      - namespace                  = "load-tester" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://flagger.app" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "0.22.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # helm_release.loadtester will be created
  + resource "helm_release" "loadtester" {
      + atomic                     = false
      + chart                      = "loadtester"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loadtester"
      + namespace                  = "loadtester"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flagger.app"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.22.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 4 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*